import folium

center = [37.554530651, 126.970713923]
m=folium.Map(location=center,zoom_start=13)

byeongjeomstn = ["병점역", "서동탄역"]
exgyeongbu = ["금천구청역", "광명역"]
gyeongbustn = ["가산디지털단지역", "독산역", "금천구청역", "광명역", "석수역", "관악역", "안양역", "명학역", "금정역", "군포역", "당정역", "의왕역", "성균관대역", "화서역", "수원역", "세류역", "병점역", "서동탄역", "세마역", "오산대역", "오산역", "진위역", "송탄역", "서정리역", "평택지제역", "평택역", "성환역", "직산역", "두정역", "천안역", "봉명역", "쌍용역", "아산역", "배방역", "온양온천역", "신창역"]
sel1stn = ["연천역", "전곡역", "청산역", "소요산역", "동두천역", "보산역", "동두천중앙역", "지행역", "덕정역", "덕계역", "양주역", "녹양역", "가능역", "의정부역", "회룡역", "망월사역", "도봉산역", "도봉역", "방학역", "창동역", "녹천역", "월계역", "광운대역", "석계역", "신이문역", "외대앞역", "회기역", "청량리역", "제기동역", "신설동역", "동묘앞역", "동대문역", "종로5가역", "종로3가역", "종각역", "시청역", "서울역", "남영역", "용산역", "노량진역", "대방역", "신길역", "영등포역", "신도림역", "구로역", "구일역", "개봉역", "오류동역", "온수역", "역곡역", "소사역", "부천역", "중동역", "송내역", "부개역", "부평역", "백운역", "동암역", "간석역", "주안역", "도화역", "제물포역", "도원역", "동인천역", "인천역"]
sinjeongstn = ["신도림역", "도림천역", "양천구청역", "신정네거리역", "까치산역"]
seongsustn = ["성수역", "용답역", "신답역", "용두역", "신설동역"]
sel2stn = ["시청역", "을지로입구역", "을지로3가역", "을지로4가역", "동대문역사문화공원역", "신당역", "상왕십리역", "왕십리역", "한양대역", "뚝섬역", "성수역", "건대입구역", "구의역", "강변역", "잠실나루역", "잠실역", "잠실새내역", "종합운동장역", "삼성역", "선릉역", "역삼역", "강남역", "교대역", "서초역", "방배역", "사당역", "낙성대역", "서울대입구역", "봉천역", "신림역", "신대방역", "구로디지털단지역", "대림역", "신도림역", "문래역", "영등포구청역", "당산역", "합정역", "홍대입구역", "신촌역", "이대역", "아현역", "충정로역"]
sel3stn = ["대화역", "주엽역", "정발산역", "마두역", "백석역", "대곡역", "화정역", "원당역", "원흥역", "삼송역", "지축역", "구파발역", "연신내역", "불광역", "녹번역", "홍제역", "무악재역", "독립문역", "경복궁역", "안국역", "종로3가역", "을지로3가역", "충무로역", "동대입구역", "약수역", "금호역", "옥수역", "압구정역", "신사역", "잠원역", "고속터미널역", "교대역", "남부터미널역", "양재역", "매봉역", "도곡역", "대치역", "학여울역", "대청역", "일원역", "수서역", "가락시장역", "경찰병원역", "오금역"]
sel4stn = ["진접역", "오남역", "별내별가람역", "당고개역", "상계역", "노원역", "창동역", "쌍문역", "수유역", "미아역", "미아사거리역", "길음역", "성신여대입구역", "한성대입구역", "혜화역", "동대문역", "동대문역사문화공원역", "충무로역", "명동역", "회현역", "서울역", "숙대입구역", "삼각지역", "신용산역", "이촌역", "동작역", "이수역", "사당역", "남태령역", "선바위역", "경마공원역", "대공원역", "과천역", "정부과천청사역", "인덕원역", "평촌역", "범계역", "금정역", "산본역", "수리산역", "대야미역", "반월역", "상록수역", "한대앞역", "중앙역", "고잔역", "초지역", "안산역", "신길온천역", "정왕역", "오이도역"]
macheonstn = ["강동역", "둔촌동역", "올림픽공원역", "방이역", "오금역", "개롱역", "거여역", "마천역"]
sel5stn = ["방화역", "개화산역", "김포공항역", "송정역", "마곡역", "발산역", "우장산역", "화곡역", "까치산역", "신정역", "목동역", "오목교역", "양평역", "영등포구청역", "영등포시장역", "신길역", "여의도역", "여의나루역", "마포역", "공덕역", "애오개역", "충정로역", "서대문역", "광화문역", "종로3가역", "을지로4가역", "동대문역사문화공원역", "청구역", "신금호역", "행당역", "왕십리역", "마장역", "답십리역", "장한평역", "군자역", "아차산역", "광나루역", "천호역", "강동역", "길동역", "굽은다리역", "명일역", "고덕역", "상일동역", "강일역", "미사역", "하남풍산역", "하남시청역", "하남검단산역"]
sel6stn = ["응암역", "역촌역", "불광역", "독바위역", "연신내역", "구산역", "응암역", "새절역", "증산역", "디지털미디어시티역", "월드컵경기장역", "마포구청역", "망원역", "합정역", "상수역", "광흥창역", "대흥역", "공덕역", "효창공원앞역", "삼각지역", "녹사평역", "이태원역", "한강진역", "버티고개역", "약수역", "청구역", "신당역", "동묘앞역", "창신역", "보문역", "안암역", "고려대역", "월곡역", "상월곡역", "돌곶이역", "석계역", "태릉입구역", "화랑대역", "봉화산역", "신내역"]
sel7stn = ["장암역", "도봉산역", "수락산역", "마들역", "노원역", "중계역", "하계역", "공릉역", "태릉입구역", "먹골역", "중화역", "상봉역", "면목역", "사가정역", "용마산역", "중곡역", "군자역", "어린이대공원역", "건대입구역", "자양(뚝섬한강공원)역", "청담역", "강남구청역", "학동역", "논현역", "반포역", "고속터미널역", "내방역", "이수역", "남성역", "숭실대입구역", "상도역", "장승배기역", "신대방삼거리역", "보라매역", "신풍역", "대림역", "남구로역", "가산디지털단지역", "철산역", "광명사거리역", "천왕역", "온수역", "까치울역", "부천종합운동장역", "춘의역", "신중동역", "부천시청역", "상동역", "삼산체육관역", "굴포천역", "부평구청역", "산곡역", "석남역"]
# sel8stn = ["별내역", "다산역", "동구릉역", "구리역", "장자호수공원역", "암사역사공원역", 
sel8stn_before_byeollae_extension = ["암사역", "천호역", "강동구청역", "몽촌토성역", "잠실역", "석촌역", "송파역", "가락시장역", "문정역", "장지역", "복정역", "산성역", "남한산성입구역", "단대오거리역", "신흥역", "수진역", "모란역"]
sel9stn = ["개화역", "김포공항역", "공항시장역", "신방화역", "마곡나루역", "양천향교역", "가양역", "증미역", "등촌역", "염창역", "신목동역", "선유도역", "당산역", "국회의사당역", "여의도역", "샛강역", "노량진역", "노들역", "흑석역", "동작역", "구반포역", "신반포역", "고속터미널역", "사평역", "신논현역", "언주역", "선정릉역", "삼성중앙역", "봉은사역", "종합운동장역", "삼전역", "석촌고분역", "석촌역", "송파나루역", "한성백제역", "올림픽공원역", "둔촌오륜역", "중앙보훈병원역"]
icn1stn = ["계양역", "귤현역", "박촌역", "임학역", "계산역", "경인교대입구역", "작전역", "갈산역", "부평구청역", "부평시장역", "부평역", "동수역", "부평삼거리역", "간석오거리역", "인천시청역", "예술회관역", "인천터미널역", "문학경기장역", "선학역", "신연수역", "원인재역", "동춘역", "동막역", "캠퍼스타운역", "테크노파크역", "지식정보단지역", "인천대입구역", "센트럴파크역", "국제업무지구역", "송도달빛축제공원역"]
icn2stn = ["검단오류역", "왕길역", "검단사거리역", "마전역", "완정역", "독정역", "검암역", "검바위역", "아시아드경기장역", "서구청역", "가정역", "가정중앙시장이역", "석남역", "서부여성회관역", "인천가좌역", "가재울역", "주안국가산단역", "주안역", "시민공원역", "석바위시장역", "인천시청역", "석천사거리역", "모래내시장역", "만수역", "남동구청역", "인천대공원역", "운연역"]
suinbundangstn = ["청량리역", "왕십리역", "서울숲역", "압구정로데오역", "강남구청역", "선정릉역", "선릉역", "한티역", "도곡역", "구룡역", "개포동역", "대모산입구역", "수서역", "복정역", "가천대역", "태평역", "모란역", "야탑역", "이매역", "서현역", "수내역", "정자역", "미금역", "오리역", "죽전역", "보정역", "구성역", "신갈역", "기흥역", "상갈역", "청명역", "영통역", "망포역", "매탄권선역", "수원시청역", "매교역", "수원역", "고색역", "오목천역", "어천역", "야목역", "사리역", "한대앞역", "중앙역", "고잔역", "초지역", "안산역", "신길온천역", "정왕역", "오이도역", "달월역", "월곶역", "소래포구역", "인천논현역", "호구포역", "남동인더스파크역", "원인재역", "연수역", "송도역", "인하대역", "숭의역", "신포역", "인천역"]
sinbundangstn = ["신사역", "논현역", "신논현역", "강남역", "양재(서초구청)역", "양재시민의숲(매헌)역", "청계산입구역", "판교역", "정자역", "미금역", "동천역", "수지구청역", "성복역", "상현역", "광교중앙역", "광교역"]
gyeonguistn = ["가좌역","신촌역","서울역"]
gyeonguijungangstn = ["임진강역", "운천역", "문산역", "파주역", "월롱역", "금촌역", "금릉역", "운정역", "야당역", "탄현역", "일산역", "풍산역", "백마역", "곡산역", "대곡역", "능곡역", "행신역", "강매역", "한국항공대역", "수색역", "디지털미디어시티역", "가좌역", "홍대입구역", "서강대역", "공덕역", "효창공원앞역", "용산역", "이촌역", "서빙고역", "한남역", "옥수역", "응봉역", "왕십리역", "청량리역", "회기역", "중랑역", "상봉역", "망우역", "양원역", "구리역", "도농역", "양정역", "덕소역", "도심역", "팔당역", "운길산역", "양수역", "신원역", "국수역", "아신역", "오빈역", "양평역", "원덕역", "용문역", "지평역"]
mangwoostn = ["광운대역","상봉역","망우역"]
gyeongchunstn = ["청량리역", "회기역", "중랑역", "상봉역", "망우역", "신내역", "갈매역", "별내역", "퇴계원역", "사릉역", "금곡역", "평내호평역", "천마산역", "마석역", "대성리역", "청평역", "상천역", "가평역", "굴봉산역", "백양리역", "강촌역", "김유정역", "남춘천역", "춘천역"]
arexstn = ["서울역", "공덕역", "홍대입구역", "디지털미디어시티역", "김포공항역", "계양역", "검암역", "청라국제도시역", "영종역", "운서역", "인천공항1터미널역", "인천공항2터미널역"]
uijeongbustn = ["발곡역", "회룡역", "범골역", "경전철의정부역", "의정부시청역", "흥선역", "의정부중앙역", "동오역", "새말역", "경기도청북부청사역", "효자역", "곤제역", "어룡역", "송산역", "탑석역"]
yonginstn = ["기흥역", "강남대역", "지석역", "어정역", "동백역", "초당역", "삼가역", "시청·용인대역", "명지대역", "김량장역", "용인중앙시장역", "고진역", "보평역", "둔전역", "전대·에버랜드역"]
gyeonggangstn = ["판교역", "성남역", "이매역", "삼동역", "경기광주역", "초월역", "곤지암역", "신둔도예촌역", "이천역", "부발역", "세종대왕릉역", "여주역"]
uistn = ["북한산우이역","솔밭공원역","4.19민주묘지역","가오리역","화계역","삼양역","삼양사거리역","솔샘역","북한산보국문역","정릉역","성신여대입구역","보문역","신설동역"]
seohaestn  = ["일산역", "풍산역", "백마역", "곡산역", "대곡역","능곡역","김포공항역","원종역","부천종합운동장역","소사역","소새울역","시흥대야역","신천역","신현역","시흥시청역","시흥능곡역","달미역","선부역","초지역","시우역","원시역"]
gimpostn = ["양촌역","구래역","마산역","장기역","운양역","걸포북변역","사우(김포시청)역","풍무역","고촌역","김포공항역"]
sinlimstn = ["샛강역","대방역","서울지방병무청역","보라매역","보라매공원역","보라매병원역","당곡역","신림역","서원역","서울대벤처타운역",'관악산(서울대)역']
gtx_astn = ["수서역","성남역","구성역","동탄역"]

uisinseolline = [[37.662949661, 127.012736174], [37.655899422, 127.013250602], [37.649565464, 127.013685743], [37.641559825, 127.016766139], [37.634126592, 127.017500871], [37.626923111, 127.018139223], [37.621336605, 127.020493947], [37.620265436, 127.013510463], [37.612175045, 127.008259432], [37.602655602, 127.013535589], [37.592356890, 127.016539959], [37.584995315, 127.019583897], [37.576516310, 127.023192923]]
seohaeline = [[37.682208866, 126.769541935], [37.672311739, 126.786348404], [37.658171992, 126.794588276], [37.645746291, 126.801806356], [37.631956474, 126.809858189], [37.619184431, 126.821013810], [37.560807353, 126.804434316], [37.524031758, 126.804871934], [37.505006930, 126.797392847], [37.482745711, 126.795215545], [37.468517256, 126.797179359], [37.450038976, 126.792949323], [37.439233885, 126.786786811], [37.409493265, 126.787853819], [37.381466607, 126.805976005], [37.370019780, 126.808734618], [37.349111858, 126.809405677], [37.334351650, 126.809964863], [37.320202241, 126.808131314], [37.313156091, 126.795759123], [37.302572476, 126.786718498]]
gimpoline = [[37.641661112, 126.614805425], [37.645343361, 126.628350334], [37.640514268, 126.643545347], [37.644017801, 126.668965465], [37.653914201, 126.683926788], [37.631663805, 126.705772203], [37.620366709, 126.719802610], [37.612356452, 126.732559687], [37.601348458, 126.770248528], [37.562291758, 126.802921066]]
sinlimline=[[37.516583192, 126.929207206], [37.512880035, 126.925483346], [37.504354053, 126.922029926], [37.500990611, 126.920685467], [37.495919799, 126.918117949], [37.492804242, 126.924782263], [37.490272954, 126.927529428], [37.484171739, 126.929784067], [37.478070329, 126.933425794], [37.472147062, 126.933816904], [37.468660507, 126.945355066]]
gtx_aline=[[37.487260862968,127.10155515462],[37.394724096,127.119652136],[37.298340438,127.104203899],[37.200138454,127.09553409]]

for i in range(4):
    folium.Marker(gtx_aline[i],popup="표시",tooltip=gtx_astn[i]).add_to(m)
for i in range(11):
    folium.Marker(sinlimline[i],popup="표시",tooltip=sinlimstn[i]).add_to(m)
for i in range(10):
    folium.Marker(gimpoline[i],popup="표시",tooltip=gimpostn[i]).add_to(m)
for i in range(21):
    folium.Marker(seohaeline[i],popup="표시",tooltip=seohaestn[i]).add_to(m)
for i in range(13):
    folium.Marker(uisinseolline[i],popup="표시",tooltip=uistn[i]).add_to(m)

folium.PolyLine(locations=gtx_aline,color="#9A6292",).add_to(m)
folium.PolyLine(locations=sinlimline,color="#6789CA",).add_to(m)
folium.PolyLine(locations=gimpoline,color="#AD8605",).add_to(m)
folium.PolyLine(locations=seohaeline,color="#8FC31F",).add_to(m)
folium.PolyLine(locations=uisinseolline,color="#B7C450",).add_to(m)

m.save("seoulmap.html")